src/cf/src/Documents/СписаниеТоваров/СписаниеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеТоваров</name>
  <basedOn>Document.ПоступлениеТоваровУслуг</basedOn>
  <registerRecords>AccumulationRegister.Убытки</registerRecords>
  <registerRecords>AccumulationRegister.ДополнительныеРасходы</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВНаличии</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПересчётТоваров</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Catalogs/УпаковкиЕдиницыИзмерения/УпаковкиЕдиницыИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УпаковкиЕдиницыИзмерения</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Единица</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Знаменатель</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МеждународноеСокращение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипИзмеряемойВеличины</name>
    <type>
      <types>EnumRef.ТипыИзмеряемыхВеличин</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковокНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Числитель</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <comment>Вес брутто</comment>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Глубина</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/Documents/СписаниеТоваров/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Перечисляет печатные формы объекта.
// См. ПечатныеФормы.НоваяКоллекцияКомандПечати
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - пополняемая коллекция команд печати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	Команда = КомандыПечати.Добавить();
	Команда.ИмяМакета = "АктСписанияТоваров";
	Команда.Представление = НСтр("ru = 'Акт списания товаров'; fr = 'Sortie de marchandises';
		|en = 'Output of goods'; es = 'Salida de mercancías'");

КонецПроцедуры

// Формирует запрошенные печатные формы.
// См. ПечатныеФормы.СформироватьПечатныеФормы
//
// Параметры:
//  МассивОбъектов        - Массив          - печатаемые объекты
//  ПараметрыПечати       - Структура       - параметры команды печати
//  КоллекцияПечатныхФорм - ТаблицаЗначений - заполняемая коллекция печатных форм
//  ОбъектыПечати         - СписокЗначений  - соответствие объектов областям печати
//  ПараметрыВывода       - Структура       - параметры окна печати
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	Если ПечатныеФормы.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктСписанияТоваров") Тогда
		Таб = Новый ТабличныйДокумент;
		Для Каждого Док Из МассивОбъектов Цикл
			НомерСтрокиНачало = Таб.ВысотаТаблицы + 1;
			ПечатьАктСписанияТоваров(Док, Таб);
			ПечатныеФормы.ЗадатьОбластьПечати(Таб, НомерСтрокиНачало, ОбъектыПечати, Док);
		КонецЦикла;
		ПечатныеФормы.ВывестиТабличныйДокумент(КоллекцияПечатныхФорм, "АктСписанияТоваров",
			НСтр("ru = 'Акт списания товаров'; fr = 'Sortie de marchandises';
			|en = 'Output of goods'; es = 'Salida de mercancías'"),
			Таб, "Документ.СписаниеТоваров.АктСписанияТоваров");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Печать

Процедура ПечатьАктСписанияТоваров(Док, Таб) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Таб.ОтображатьСетку = Ложь;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	Таб.АвтоМасштаб = Истина;
	Таб.КлючПараметровПечати = "Параметры_печати_Документ_СписаниеТоваров_АктСписанияТоваров";
	Макет = ПечатныеФормы.МакетПечатнойФормы("Документ.СписаниеТоваров.АктСписанияТоваров");	
	оЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	оЗаголовок.Параметры.ТекстЗаголовка = РаботаСДокументами.КраткоеПредставлениеДокумента(Док, НСтр("fr = 'Sortie de marchandises'; ru = 'Списание товаров'; en = 'Write-off of goods'; es = 'Paso a pérdidas y ganancias'"));	
	Таб.Вывести(оЗаголовок);
	оРеквизитыОрганизации = Макет.ПолучитьОбласть("РеквизитыОрганизации");	
	оРеквизитыОрганизации.Параметры.ПредставлениеОрганизации = Док.Организация;
	оРеквизитыОрганизации.Параметры.ПредставлениеСклада = Док.МестоХранения;
	Таб.Вывести(оРеквизитыОрганизации);
	Таб.Вывести(Макет.ПолучитьОбласть("ШапкаТаблицы"));
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ВЗ.НомерСтроки КАК НомерСтроки,
		                      |	ВЗ.Артикул КАК Артикул,
		                      |	ВЗ.Номенклатура КАК Номенклатура,
		                      |	ВЗ.Характеристика КАК Характеристика,
		                      |	ВЗ.КоличествоМест КАК КоличествоМест,
		                      |	ВЗ.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		                      |	ВЗ.Количество КАК Количество,
		                      |	ВЗ.ЕдиницаХранения КАК ЕдиницаХранения,
		                      |	ВЗ.Сумма КАК Сумма,
		                      |	ВЫРАЗИТЬ(ВЗ.Сумма / ВЗ.Количество КАК ЧИСЛО(12, 2)) КАК Цена
		                      |ИЗ
		                      |	(ВЫБРАТЬ
		                      |		ВЗ.НомерСтроки КАК НомерСтроки,
		                      |		ВЗ.Номенклатура.Артикул КАК Артикул,
		                      |		ВЗ.Номенклатура КАК Номенклатура,
		                      |		ВЗ.Характеристика КАК Характеристика,
		                      |		ВЗ.КоличествоМест КАК КоличествоМест,
		                      |		ВЗ.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		                      |		ВЗ.Количество КАК Количество,
		                      |		ВЗ.Номенклатура.Единица КАК ЕдиницаХранения,
		                      |		ВЫБОР
		                      |			КОГДА ЕСТЬNULL(ТоварыВНаличииОбороты.КоличествоРасход, 0) = 0
		                      |				ТОГДА 0
		                      |			ИНАЧЕ ЕСТЬNULL(ТоварыВНаличииОбороты.СуммаРасход, 0) / ЕСТЬNULL(ТоварыВНаличииОбороты.КоличествоРасход, 0) * ВЗ.Количество
		                      |		КОНЕЦ КАК Сумма
		                      |	ИЗ
		                      |		(ВЫБРАТЬ
		                      |			ТЧТовары.Ссылка КАК Ссылка,
		                      |			ТЧТовары.НомерСтроки КАК НомерСтроки,
		                      |			ТЧТовары.Номенклатура КАК Номенклатура,
		                      |			ТЧТовары.Характеристика КАК Характеристика,
		                      |			ТЧТовары.КоличествоУпаковок КАК КоличествоМест,
		                      |			ВЫБОР
		                      |				КОГДА ТЧТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		                      |					ТОГДА ТЧТовары.Номенклатура.Единица
		                      |				ИНАЧЕ ТЧТовары.Упаковка
		                      |			КОНЕЦ КАК ЕдиницаИзмерения,
		                      |			ТЧТовары.Количество КАК Количество
		                      |		ИЗ
		                      |			Документ.СписаниеТоваров.ТЧТовары КАК ТЧТовары
		                      |		ГДЕ
		                      |			ТЧТовары.Ссылка = &Док) КАК ВЗ
		                      |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВНаличии.Обороты(, , Регистратор, ) КАК ТоварыВНаличииОбороты
		                      |			ПО ВЗ.Ссылка = ТоварыВНаличииОбороты.Регистратор
		                      |				И ВЗ.Номенклатура = ТоварыВНаличииОбороты.Номенклатура
		                      |				И ВЗ.Характеристика = ТоварыВНаличииОбороты.Характеристика) КАК ВЗ");
	Запрос.УстановитьПараметр("Док", Док);
	ТЗ = Запрос.Выполнить().Выгрузить();
	оСтрока = Макет.ПолучитьОбласть("Строка"); 	
	Для Каждого Стр Из ТЗ Цикл
		оСтрока.Параметры.Заполнить(Стр);
		оСтрока.Параметры.Товар = ОбщегоНазначенияКлиентСервер.ПредставлениеНоменклатуры(Стр.Номенклатура, Стр.Характеристика, , Истина);
		Таб.Вывести(оСтрока);
	КонецЦикла;
	оИтого = Макет.ПолучитьОбласть("Итого");
	СуммаСписания = ТЗ.Итог("Сумма");
	оИтого.Параметры.Всего = СуммаСписания;
	Таб.Вывести(оИтого);
	оСуммаПрописью = Макет.ПолучитьОбласть("СуммаПрописью");
	//оСуммаПрописью.Параметры.ИтоговаяСтрока = "Всего наименований " + СокрЛП(ТЗ.Количество()) + ", на сумму " + Формат(СуммаСписания, "ЧЦ=12; ЧДЦ=2") + " руб.";
	оСуммаПрописью.Параметры.СуммаПрописью = Справочники.Валюты.СформироватьСуммуПрописью(СуммаСписания, Справочники.Валюты.MoroccanDirham, Перечисления.Локализации.fr_CA);
	Таб.Вывести(оСуммаПрописью);
	Таб.Вывести(Макет.ПолучитьОбласть("Подписи"));
	Таб.ВывестиГоризонтальныйРазделительСтраниц();
	Таб.ИспользуемоеИмяФайла = РаботаСДокументами.КраткоеПредставлениеДокумента(Док, "Акт списания");
КонецПроцедуры

#КонецОбласти
